{"modelTopology": {"keras_version": "2.0.3", "backend": "tensorflow", "model_config": {"config": [{"config": {"kernel_size": [7, 7], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "padding": "same", "dtype": "float32", "use_bias": true, "trainable": true, "dilation_rate": [1, 1], "bias_regularizer": null, "batch_input_shape": [null, 48, 48, 1], "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "image_array", "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_1", "epsilon": 0.001, "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"kernel_size": [7, 7], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 16, "padding": "same", "use_bias": true, "name": "conv2d_1", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_2", "epsilon": 0.001, "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "average_pooling2d_1", "padding": "same", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_size": [5, 5], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "padding": "same", "use_bias": true, "name": "conv2d_2", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_3", "epsilon": 0.001, "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"kernel_size": [5, 5], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 32, "padding": "same", "use_bias": true, "name": "conv2d_3", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_4", "epsilon": 0.001, "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "average_pooling2d_2", "padding": "same", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "name": "dropout_2", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "padding": "same", "use_bias": true, "name": "conv2d_4", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_5", "epsilon": 0.001, "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 64, "padding": "same", "use_bias": true, "name": "conv2d_5", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_6", "epsilon": 0.001, "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_3"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "average_pooling2d_3", "padding": "same", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "name": "dropout_3", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "padding": "same", "use_bias": true, "name": "conv2d_6", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_7", "epsilon": 0.001, "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 128, "padding": "same", "use_bias": true, "name": "conv2d_7", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_8", "epsilon": 0.001, "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_4"}, "class_name": "Activation"}, {"config": {"pool_size": [2, 2], "name": "average_pooling2d_4", "padding": "same", "strides": [2, 2], "data_format": "channels_last", "trainable": true}, "class_name": "AveragePooling2D"}, {"config": {"trainable": true, "name": "dropout_4", "rate": 0.5}, "class_name": "Dropout"}, {"config": {"kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 256, "padding": "same", "use_bias": true, "name": "conv2d_8", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_constraint": null, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "momentum": 0.99, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "gamma_constraint": null, "name": "batch_normalization_9", "epsilon": 0.001, "center": true, "scale": true}, "class_name": "BatchNormalization"}, {"config": {"kernel_size": [3, 3], "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 7, "padding": "same", "use_bias": true, "name": "conv2d_9", "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "trainable": true, "activation": "linear", "strides": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "global_average_pooling2d_1"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"activation": "softmax", "trainable": true, "name": "predictions"}, "class_name": "Activation"}], "class_name": "Sequential"}, "training_config": {"loss": "categorical_crossentropy", "optimizer_config": {"config": {"lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "decay": 0.0, "epsilon": 1e-08}, "class_name": "Adam"}, "metrics": ["accuracy"], "loss_weights": null, "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [16], "dtype": "float32"}]}, {"paths": ["group2-shard1of1"], "weights": [{"name": "batch_normalization_2/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [16], "dtype": "float32"}]}, {"paths": ["group3-shard1of1"], "weights": [{"name": "batch_normalization_3/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group4-shard1of1"], "weights": [{"name": "batch_normalization_4/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [32], "dtype": "float32"}]}, {"paths": ["group5-shard1of1"], "weights": [{"name": "batch_normalization_5/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group6-shard1of1"], "weights": [{"name": "batch_normalization_6/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [64], "dtype": "float32"}]}, {"paths": ["group7-shard1of1"], "weights": [{"name": "batch_normalization_7/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group8-shard1of1"], "weights": [{"name": "batch_normalization_8/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [128], "dtype": "float32"}]}, {"paths": ["group9-shard1of1"], "weights": [{"name": "batch_normalization_9/gamma", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [256], "dtype": "float32"}]}, {"paths": ["group10-shard1of1"], "weights": [{"name": "conv2d_1/kernel", "shape": [7, 7, 16, 16], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [16], "dtype": "float32"}]}, {"paths": ["group11-shard1of1"], "weights": [{"name": "conv2d_2/kernel", "shape": [5, 5, 16, 32], "dtype": "float32"}, {"name": "conv2d_2/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group12-shard1of1"], "weights": [{"name": "conv2d_3/kernel", "shape": [5, 5, 32, 32], "dtype": "float32"}, {"name": "conv2d_3/bias", "shape": [32], "dtype": "float32"}]}, {"paths": ["group13-shard1of1"], "weights": [{"name": "conv2d_4/kernel", "shape": [3, 3, 32, 64], "dtype": "float32"}, {"name": "conv2d_4/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group14-shard1of1"], "weights": [{"name": "conv2d_5/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "conv2d_5/bias", "shape": [64], "dtype": "float32"}]}, {"paths": ["group15-shard1of1"], "weights": [{"name": "conv2d_6/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "conv2d_6/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group16-shard1of1"], "weights": [{"name": "conv2d_7/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [128], "dtype": "float32"}]}, {"paths": ["group17-shard1of1"], "weights": [{"name": "conv2d_8/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "conv2d_8/bias", "shape": [256], "dtype": "float32"}]}, {"paths": ["group18-shard1of1"], "weights": [{"name": "conv2d_9/kernel", "shape": [3, 3, 256, 7], "dtype": "float32"}, {"name": "conv2d_9/bias", "shape": [7], "dtype": "float32"}]}, {"paths": ["group19-shard1of1"], "weights": [{"name": "image_array/kernel", "shape": [7, 7, 1, 16], "dtype": "float32"}, {"name": "image_array/bias", "shape": [16], "dtype": "float32"}]}]}